# Bike Sales Data Analysis

### Importing libraries

In [43]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [44]:
filename = './data.csv'
df = pd.read_csv(filename)

In [45]:
df.head()

,ID,Marital Status,Gender,Income,Children,Education,Occupation,Home Owner,Cars,Commute Distance,Region,Age,Purchased Bike
0,12496,M,F,"$40,000.00",1,Bachelors,Skilled Manual,Yes,0,0-1 Miles,Europe,42,No
1,24107,M,M,"$30,000.00",3,Partial College,Clerical,Yes,1,0-1 Miles,Europe,43,No
2,14177,M,M,"$80,000.00",5,Partial College,Professional,No,2,2-5 Miles,Europe,60,No
3,24381,S,M,"$70,000.00",0,Bachelors,Professional,Yes,1,5-10 Miles,Pacific,41,Yes
4,25597,S,M,"$30,000.00",0,Bachelors,Clerical,No,0,0-1 Miles,Europe,36,Yes

### Cleaning the data

In [46]:
df.isna().any(axis=0)

ID                  False
Marital Status      False
Gender              False
Income              False
Children            False
Education           False
Occupation          False
Home Owner          False
Cars                False
Commute Distance    False
Region              False
Age                 False
Purchased Bike      False
dtype: bool

In [47]:
df.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
1021     True
1022     True
1023     True
1024     True
1025     True
Length: 1026, dtype: bool

In [48]:
df.drop_duplicates(inplace=True)

In [49]:
df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Length: 1000, dtype: bool

In [50]:
df.dtypes

ID                   int64
Marital Status      object
Gender              object
Income              object
Children             int64
Education           object
Occupation          object
Home Owner          object
Cars                 int64
Commute Distance    object
Region              object
Age                  int64
Purchased Bike      object
dtype: object

In [51]:
df['Income'] = df['Income'].apply(lambda x: ''.join(i for i in x[:-2] if i.isnumeric()))

In [52]:
df['Income'] = df['Income'].astype('int64')

In [53]:
df['Income'].head()

0    40000
1    30000
2    80000
3    70000
4    30000
Name: Income, dtype: int64

In [54]:
df['Marital Status'] = df['Marital Status'].replace({'M': 'Married', 'S': 'Single'})

In [55]:
df['Gender'] = df['Gender'].replace({'M': 'Male', 'F': 'Female'})

In [56]:
df.head()

,ID,Marital Status,Gender,Income,Children,Education,Occupation,Home Owner,Cars,Commute Distance,Region,Age,Purchased Bike
0,12496,Married,Female,40000,1,Bachelors,Skilled Manual,Yes,0,0-1 Miles,Europe,42,No
1,24107,Married,Male,30000,3,Partial College,Clerical,Yes,1,0-1 Miles,Europe,43,No
2,14177,Married,Male,80000,5,Partial College,Professional,No,2,2-5 Miles,Europe,60,No
3,24381,Single,Male,70000,0,Bachelors,Professional,Yes,1,5-10 Miles,Pacific,41,Yes
4,25597,Single,Male,30000,0,Bachelors,Clerical,No,0,0-1 Miles,Europe,36,Yes

In [57]:
df.drop(columns='ID', inplace=True)

In [66]:
df['Commute Distance'] = df['Commute Distance'].replace('10+ Miles', 'More than 10 Miles')

### Analyzing the Data

In [58]:
df.columns

Index(['Marital Status', 'Gender', 'Income', 'Children', 'Education',
       'Occupation', 'Home Owner', 'Cars', 'Commute Distance', 'Region', 'Age',
       'Purchased Bike'],
      dtype='object')

In [59]:
df.describe()

              Income     Children         Cars          Age
count    1000.000000  1000.000000  1000.000000  1000.000000
mean    56360.000000     1.898000     1.442000    44.163000
std     31085.635215     1.628572     1.125123    11.364488
min     10000.000000     0.000000     0.000000    25.000000
25%     30000.000000     0.000000     1.000000    35.000000
50%     60000.000000     2.000000     1.000000    43.000000
75%     70000.000000     3.000000     2.000000    52.000000
max    170000.000000     5.000000     4.000000    89.000000

### Creating 'Age bracket' column

In [60]:
def age_bracket(age):
    if age < 31:
        return 'Adolescent'
    elif 31 <= age <= 54:
        return 'Middle Age'
    else:
        return 'Old'

In [61]:
df['Age Bracket'] = df['Age'].apply(age_bracket)

In [62]:
df.head()

,Marital Status,Gender,Income,Children,Education,Occupation,Home Owner,Cars,Commute Distance,Region,Age,Purchased Bike,Age Bracket
0,Married,Female,40000,1,Bachelors,Skilled Manual,Yes,0,0-1 Miles,Europe,42,No,Middle Age
1,Married,Male,30000,3,Partial College,Clerical,Yes,1,0-1 Miles,Europe,43,No,Middle Age
2,Married,Male,80000,5,Partial College,Professional,No,2,2-5 Miles,Europe,60,No,Old
3,Single,Male,70000,0,Bachelors,Professional,Yes,1,5-10 Miles,Pacific,41,Yes,Middle Age
4,Single,Male,30000,0,Bachelors,Clerical,No,0,0-1 Miles,Europe,36,Yes,Middle Age

### What is the average income of those who bought and those who did not buy a bike?

In [63]:
df.groupby('Purchased Bike')['Income'].mean()

Purchased Bike
No     54874.759152
Yes    57962.577963
Name: Income, dtype: float64

In [64]:
df.groupby(['Purchased Bike', 'Gender'])['Income'].mean()

Purchased Bike  Gender
No              Female    53440.000000
                Male      56208.178439
Yes             Female    55774.058577
                Male      60123.966942
Name: Income, dtype: float64

### Bike Purchases by Commuting Distance

In [70]:
df.groupby(['Commute Distance','Purchased Bike']).size()

Commute Distance    Purchased Bike
0-1 Miles           No                166
                    Yes               200
1-2 Miles           No                 92
                    Yes                77
2-5 Miles           No                 67
                    Yes                95
5-10 Miles          No                116
                    Yes                76
More than 10 Miles  No                 78
                    Yes                33
dtype: int64

In [42]:
df['Purchased Bike'].count()

np.int64(951)